src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТБК_ВедомостьОПродажахЗаДень</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено_ПКО</Name>
					<Comment>:</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажнеНеУчтено_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоБанковскимКартам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяБезНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличныеКСдаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продаца_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаКакуюДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыОРозничныхПродажах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтчетОРозничныхПродажах</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПоБанковскимКартам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаНаличными</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяБезНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыемкаДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выемка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПродавца</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТБКТипыПродавцов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяСмены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродавецНаЗамену</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры5000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры2000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Enums/ТБКТипыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТБКТипыПродавцов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВторойПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МладшийПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НочнойПродавец</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КассыККМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьКассуПоРабочемуМесту();
		ЗаполнитьПоДаннымКассы();
	КонецЕсли;

	ЗаполнитьСписокВыбораПоставщиков();

	// Вик 2024-10-21: с ноября 2024 тип продавца и признак замены не показываем.
	Элементы.ПродавцыПродавецНаЗамену.Видимость = Ложь;
	Элементы.ПродавцыТипПродавца.Видимость = Ложь;

	// Номера купюр правят только в день ведомости.
	Если ЗначениеЗаполнено(Объект.Дата) И НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
		Элементы.Группа_Купюры.ТолькоПросмотр = Истина;
	КонецЕсли;

	ОбновитьПоказателиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Вик 2021-10-18: новую ведомость сохраняем сразу, чтобы данные смены не потерялись,
	// если кассир просто закроет окно.
	Если Объект.Ссылка.Пустая() Тогда
		ЗаписатьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	// Вик 2021-10-18: изменения в новой ведомости сохраняем без вопроса «Сохранить?».
	// Если записать не удалось, платформа сама спросит о несохраненных данных.
	// При завершении работы программы обращаться к серверу нельзя.
	Если Параметры.Ключ.Пустая() И Модифицированность И Не ЗавершениеРаботы Тогда
		ЗаписатьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Автосохранение (см. ЗаписатьНаСервере) не проверяет продавцов и отчеты - см. модуль объекта.
	Если ПараметрыЗаписи.Свойство("Автосохранение") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Автосохранение", Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// При записи ведомость могла дополнить тип продавца.
	Элементы.ПродавцыПодробно.Заголовок = ЗаголовокПродавцов(ТекущийОбъект.Продавцы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВедомостьПродажНеУчтеноПриИзменении(Элемент)
	РассчитатьНаличныеКСдаче(Объект);
КонецПроцедуры

&НаКлиенте
Процедура РасходыОтделаПриИзменении(Элемент)
	РассчитатьНаличныеКСдаче(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗП_продавцаПриИзменении(Элемент)
	РассчитатьНаличныеКСдаче(Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплатаПоставщику

&НаКлиенте
Процедура ОплатаПоставщикуПриИзменении(Элемент)
	РассчитатьНаличныеКСдаче(Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродавцы

&НаКлиенте
Процедура ПродавцыПриИзменении(Элемент)
	Элементы.ПродавцыПодробно.Заголовок = ЗаголовокПродавцов(Объект.Продавцы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьПоДаннымКассы();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыемку(Команда)

	ТекущиеДанные = Элементы.ОтчетыОРозничныхПродажах.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("СоздатьВыемкуЗавершение", ЭтотОбъект, ТекущиеДанные.ОтчетОРозничныхПродажах);
	ТипСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ПоказатьВводЗначения(Оповещение, 0, НСтр("ru = 'Сумма выемки'"), ТипСуммы);

КонецПроцедуры

&НаКлиенте
Процедура ВнестиДанныеПоВыручке(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОплатаНаличными", Объект.ОплатаНаличными);
	ПараметрыФормы.Вставить("ОплатаПоБанковскимКартам", Объект.ОплатаПоБанковскимКартам);
	ПараметрыФормы.Вставить("ТерминальнаяСверкаНеВышла", Объект.ТерминальнаяСверкаНеВышла);

	// Первая строка данных по выручке - наличные, вторая - безналичные (см. ПослеВнесенияДанныхПоВыручке).
	Если Объект.ДанныеПоВыручке.Количество() >= 2 Тогда
		ПараметрыФормы.Вставить("НаличныйZ", Объект.ДанныеПоВыручке[0].ZОтчет);
		ПараметрыФормы.Вставить("НаличныйФакт", Объект.ДанныеПоВыручке[0].Фактически);
		ПараметрыФормы.Вставить("БезНаличныйZ", Объект.ДанныеПоВыручке[1].ZОтчет);
		ПараметрыФормы.Вставить("БезНаличныйФакт", Объект.ДанныеПоВыручке[1].Фактически);
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеВнесенияДанныхПоВыручке", ЭтотОбъект);
	ОткрытьФорму("Документ.ТБК_ВедомостьОПродажахЗаДень.Форма.ФормаДанныеПоВыручке", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыемкаПодробно(Команда)
	Элементы.ВыемкаДенежныхСредств.Видимость = Не Элементы.ВыемкаДенежныхСредств.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура Купюры(Команда)
	Элементы.Группа_Купюры.Видимость = Не Элементы.Группа_Купюры.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПодробно(Команда)
	Элементы.ОтчетыОРозничныхПродажах.Видимость = Не Элементы.ОтчетыОРозничныхПродажах.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПродавцыПодробно(Команда)
	Элементы.Продавцы.Видимость = Не Элементы.Продавцы.Видимость;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьВыемкуЗавершение(Сумма, ОтчетОРозничныхПродажах) Экспорт

	Если Не ЗначениеЗаполнено(Сумма) Тогда
		Возврат;
	КонецЕсли;

	СоздатьВыемкуНаСервере(ОтчетОРозничныхПродажах, Сумма);

КонецПроцедуры

&НаСервере
Процедура СоздатьВыемкуНаСервере(Знач ОтчетОРозничныхПродажах, Знач Сумма)

	Документы.ТБК_ВедомостьОПродажахЗаДень.СоздатьВыемкуПоОтчету(ОтчетОРозничныхПродажах, Сумма);
	ЗаполнитьПоДаннымКассы();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВнесенияДанныхПоВыручке(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.ДанныеПоВыручке.Очистить();
	ДобавитьДанныеПоВыручке("Наличные", Результат.НаличныйZ, Результат.НаличныйФакт);
	ДобавитьДанныеПоВыручке("Безналичные", Результат.БезНаличныйZ, Результат.БезНаличныйФакт);
	Объект.ТерминальнаяСверкаНеВышла = Результат.ТерминальнаяСверкаНеВышла;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеПоВыручке(ТипДС, ZОтчет, Фактически)

	НоваяСтрока = Объект.ДанныеПоВыручке.Добавить();
	НоваяСтрока.ТипДС = ТипДС;
	НоваяСтрока.ZОтчет = ZОтчет;
	НоваяСтрока.Фактически = Фактически;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымКассы()

	Если Не ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите кассу ККМ.'"), , "КассаККМ", "Объект");
		Возврат;
	КонецЕсли;

	Ведомость = РеквизитФормыВЗначение("Объект");
	Документы.ТБК_ВедомостьОПродажахЗаДень.ЗаполнитьПоДаннымКассы(Ведомость);
	ЗначениеВРеквизитФормы(Ведомость, "Объект");

	РассчитатьНаличныеКСдаче(Объект);
	ОбновитьПоказателиФормы();
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКассуПоРабочемуМесту()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК КассаККМ,
	|	КассыККМ.Магазин КАК Магазин,
	|	Магазины.СкладПродажи КАК Склад
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Магазины КАК Магазины
	|		ПО (Магазины.Ссылка = КассыККМ.Магазин)
	|ГДЕ
	|	КассыККМ.РабочееМесто = &РабочееМесто
	|	И НЕ КассыККМ.ПометкаУдаления");
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.РабочееМестоКлиента());
	КассыРабочегоМеста = Запрос.Выполнить().Выгрузить();

	// Если касс на рабочем месте несколько, кассу ККМ не угадываем: ее передает РМК или выбирает кассир.
	Если КассыРабочегоМеста.Количество() > 0 Тогда
		ЗаполняемыеСвойства = ?(КассыРабочегоМеста.Количество() = 1, "КассаККМ, Магазин, Склад", "Магазин, Склад");
		ЗаполнитьЗначенияСвойств(Объект, КассыРабочегоМеста[0], ЗаполняемыеСвойства);
	КонецЕсли;

	// РМК после закрытия смены передает кассу, смену которой закрыли.
	КассаИзПараметров = Неопределено;
	Если Параметры.Свойство("КассаККМ", КассаИзПараметров) И ЗначениеЗаполнено(КассаИзПараметров) Тогда
		Объект.КассаККМ = КассаИзПараметров;
		ДанныеКассы = КассыРабочегоМеста.Найти(КассаИзПараметров, "КассаККМ");
		Если ДанныеКассы <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, ДанныеКассы, "Магазин, Склад");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоставщиков()

	// Поставщики, которым платят из кассы (из старой Розницы; ЛК Андрей: Корунд заменили на Стоун).
	НаименованияПоставщиков = Новый Массив;
	НаименованияПоставщиков.Добавить("СТОУН , ООО");
	НаименованияПоставщиков.Добавить("СНС Северо-Запад ООО");

	Поставщики = Новый Массив;
	Для Каждого Наименование Из НаименованияПоставщиков Цикл
		Поставщик = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
		Если ЗначениеЗаполнено(Поставщик) Тогда
			Поставщики.Добавить(Поставщик);
		КонецЕсли;
	КонецЦикла;

	Элементы.ОплатаПоставщикуКонтрагент.СписокВыбора.ЗагрузитьЗначения(Поставщики);

КонецПроцедуры

// Автосохранение: записывает и проводит ведомость без вопросов пользователю. Причины отказа
// проверки уже сообщены пользователю, подробности ошибки пишутся в журнал регистрации.
&НаСервере
Процедура ЗаписатьНаСервере()

	Попытка
		Записать(Новый Структура("РежимЗаписи, Автосохранение", РежимЗаписиДокумента.Проведение, Истина));
	Исключение
		ИнформацияОшибки = ИнформацияОбОшибке();
		ИмяСобытия = НСтр("ru = 'ТБК.Ведомость о продажах за день'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ТБК_ВедомостьОПродажахЗаДень, Объект.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОшибки));
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ведомость не сохранена: %1'"), КраткоеПредставлениеОшибки(ИнформацияОшибки));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиФормы()

	СуммаВыемки = Объект.ВыемкаДенежныхСредств.Итог("Сумма");
	Элементы.ПродавцыПодробно.Заголовок = ЗаголовокПродавцов(Объект.Продавцы);

КонецПроцедуры

// Наличные к сдаче: наличная выручка и неучтенка за вычетом возвратов наличными,
// расходов отдела и зарплаты продавца.
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьНаличныеКСдаче(ДанныеВедомости)

	ДанныеВедомости.НаличныеКСдаче = ДанныеВедомости.ОплатаНаличными
		+ ДанныеВедомости.ВедомостьПродажНеУчтено
		- ДанныеВедомости.ВозвратОтПокупателяНал
		- ДанныеВедомости.РасходыОтдела
		- ДанныеВедомости.ЗП_Продавца;

КонецПроцедуры

// Заголовок кнопки «Продавцы»: основной и второй продавец смены.
&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокПродавцов(Знач Продавцы)

	ТипОсновной = ПредопределенноеЗначение("Перечисление.ТБКТипыПродавцов.ОсновнойПродавец");
	ТипВторой = ПредопределенноеЗначение("Перечисление.ТБКТипыПродавцов.ВторойПродавец");

	ОсновнойПродавец = "";
	ВторойПродавец = "";
	Для Каждого СтрокаПродавца Из Продавцы Цикл
		Если СтрокаПродавца.ТипПродавца = ТипОсновной Тогда
			ОсновнойПродавец = "(Основной) " + СтрокаПродавца.Продавец;
		КонецЕсли;
		Если СтрокаПродавца.ТипПродавца = ТипВторой Тогда
			ВторойПродавец = "(Второй) " + СтрокаПродавца.Продавец;
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(ОсновнойПродавец) И ЗначениеЗаполнено(ВторойПродавец) Тогда
		Возврат ОсновнойПродавец + Символы.ПС + ВторойПродавец;
	КонецЕсли;
	Возврат ОсновнойПродавец + ВторойПродавец;

КонецФункции

#КонецОбласти
